{
    "post": [
        {
            "id": "1",
            "title": "Tips Menulis Blog yang Menarik",
            "content": "Menulis blog adalah cara yang bagus untuk berbagi pengetahuan dan pengalaman Anda dengan dunia. Berikut adalah beberapa tips untuk menulis blog yang menarik:",
            "category": "HTML",
            "author": "Jane Smith",
            "date": "2023-03-10"
        },
        {
            "id": "2",
            "title": "Tips Menulis Blog yang Menarik",
            "content": "Menulis blog adalah cara yang bagus untuk berbagi pengetahuan dan pengalaman Anda dengan dunia. Berikut adalah beberapa tips untuk menulis blog yang menarik:",
            "author": "Jane Smith",
            "date": "2023-03-10"
        },
        {
            "id": "3",
            "title": "Panduan Pemula untuk SEO",
            "content": "SEO (Search Engine Optimization) adalah proses mengoptimalkan situs web Anda agar mendapat peringkat lebih tinggi di halaman hasil mesin pencari (SERP).",
            "author": "John Doe",
            "date": "2023-03-12"
        },
        {
            "id": "4",
            "title": "Cara Membangun Situs Web yang Efektif",
            "content": "Membangun situs web yang efektif sangat penting untuk bisnis apa pun. Berikut adalah beberapa tips untuk membangun situs web yang efektif:",
            "author": "Jane Smith",
            "date": "2023-03-14"
        },
        {
            "id": "5",
            "title": "Tren Pemasaran Digital Terbaru",
            "content": "Pemasaran digital terus berkembang, dengan tren baru bermunculan setiap saat. Berikut adalah beberapa tren pemasaran digital terbaru:",
            "author": "John Doe",
            "date": "2023-03-16"
        },
        {
            "id": "6",
            "title": "Belajar Express.js untuk Pemula",
            "content": "Express.js adalah framework web yang populer untuk Node.js. Framework ini memudahkan pembuatan aplikasi web yang cepat, skalabel, dan aman. Dalam tutorial ini, kita akan mempelajari dasar-dasar Express.js dan cara menggunakannya untuk membuat aplikasi web sederhana."
        },
        {
            "id": "7",
            "title": "Membuat API REST dengan Express.js",
            "content": "API REST (Representational State Transfer) adalah antarmuka pemrograman aplikasi yang digunakan untuk mengakses dan memodifikasi data melalui HTTP. Dalam tutorial ini, kita akan mempelajari cara membuat API REST sederhana menggunakan Express.js."
        },
        {
            "id": "8",
            "title": "Menambahkan Autentikasi ke Aplikasi Express.js",
            "content": "Autentikasi adalah proses memverifikasi identitas pengguna. Dalam tutorial ini, kita akan mempelajari cara menambahkan autentikasi ke aplikasi Express.js menggunakan Passport.js, middleware yang populer untuk autentikasi."
        },
        {
            "id": "9",
            "title": "Menggunakan MongoDB dengan Express.js",
            "content": "MongoDB adalah database NoSQL yang populer. Dalam tutorial ini, kita akan mempelajari cara menggunakan MongoDB dengan Express.js untuk menyimpan dan mengambil data."
        },
        {
            "id": "10",
            "title": "Membuat Aplikasi Blog dengan Express.js dan MongoDB",
            "content": "Dalam tutorial ini, kita akan mempelajari cara membuat aplikasi blog sederhana menggunakan Express.js dan MongoDB. Kita akan membahas cara membuat model data, membuat rute, dan menampilkan data di halaman web."
        }
    ]
}